Meta:
@sprint_42
@us_111.4

Narrative:
Как владелец,
Я хочу зарегистрировать чек продажи,
Чтобы зафиксировать факт продажи в системе

Scenario: Оплата продажи с помощью банковской карты

Meta:
@smoke

Scenario: Оплата продажи с помощью наличных денег

Meta:
@smoke

Scenario: Перерасчет сдачи

Meta:
@smoke

Scenario: Регистрация продажи в системе

Meta:
@smoke

Scenario: После успешной продажи чек не содержит товарных позиций

Meta:

Scenario: После успешной продажи автокомплит не содержит результатов

Meta:

Scenario: Валидация поля внесенная сумма значением 99,999

Meta:
@smoke

Scenario: По умолчанию продажа совершается с помощьюю наличных

Meta:

