Meta:
@smoke
@precondition
@sprint_41
@us_111.2

Scenario: Сценарий для большого количества товаров через консольную команду для тестирования скролла в чеке

Given пользователь с адресом электронной почты 's41u1111@lighthouse.pro' создает группу с именем 'pos-group1'
And пользователь с адресом электронной почты 's41u1111@lighthouse.pro' создает продукт с именем 'pos-product1', еденицами измерения 'шт.', штрихкодом 'post-barcode-1', НДС '0', ценой закупки '100' и ценой продажи '110' в группе с именем 'pos-group1'
And пользователь с адресом электронной почты 's41u1111@lighthouse.pro' создает продукт с именем 'pos-product2', еденицами измерения 'шт.', штрихкодом 'post-barcode-2', НДС '0', ценой закупки '100' и ценой продажи '110' в группе с именем 'pos-group1'
And пользователь с адресом электронной почты 's41u1111@lighthouse.pro' создает продукт с именем 'pos-product3', еденицами измерения 'шт.', штрихкодом 'post-barcode-3', НДС '0', ценой закупки '100' и ценой продажи '110' в группе с именем 'pos-group1'
And пользователь с адресом электронной почты 's41u1111@lighthouse.pro' создает продукт с именем 'pos-product4', еденицами измерения 'шт.', штрихкодом 'post-barcode-4', НДС '0', ценой закупки '100' и ценой продажи '110' в группе с именем 'pos-group1'
And пользователь с адресом электронной почты 's41u1111@lighthouse.pro' создает продукт с именем 'pos-product5', еденицами измерения 'шт.', штрихкодом 'post-barcode-5', НДС '0', ценой закупки '100' и ценой продажи '110' в группе с именем 'pos-group1'
And пользователь с адресом электронной почты 's41u1111@lighthouse.pro' создает продукт с именем 'pos-product6', еденицами измерения 'шт.', штрихкодом 'post-barcode-6', НДС '0', ценой закупки '100' и ценой продажи '110' в группе с именем 'pos-group1'
And пользователь с адресом электронной почты 's41u1111@lighthouse.pro' создает продукт с именем 'pos-product7', еденицами измерения 'шт.', штрихкодом 'post-barcode-7', НДС '0', ценой закупки '100' и ценой продажи '110' в группе с именем 'pos-group1'
And пользователь с адресом электронной почты 's41u1111@lighthouse.pro' создает продукт с именем 'pos-product8', еденицами измерения 'шт.', штрихкодом 'post-barcode-8', НДС '0', ценой закупки '100' и ценой продажи '110' в группе с именем 'pos-group1'
And пользователь с адресом электронной почты 's41u1111@lighthouse.pro' создает продукт с именем 'pos-product9', еденицами измерения 'шт.', штрихкодом 'post-barcode-9', НДС '0', ценой закупки '100' и ценой продажи '110' в группе с именем 'pos-group1'
And пользователь с адресом электронной почты 's41u1111@lighthouse.pro' создает продукт с именем 'pos-product10', еденицами измерения 'шт.', штрихкодом 'post-barcode-10', НДС '0', ценой закупки '100' и ценой продажи '110' в группе с именем 'pos-group1'
And пользователь с адресом электронной почты 's41u1111@lighthouse.pro' создает продукт с именем 'pos-product11', еденицами измерения 'шт.', штрихкодом 'post-barcode-11', НДС '0', ценой закупки '100' и ценой продажи '110' в группе с именем 'pos-group1'
And пользователь с адресом электронной почты 's41u1111@lighthouse.pro' создает продукт с именем 'pos-product12', еденицами измерения 'шт.', штрихкодом 'post-barcode-12', НДС '0', ценой закупки '100' и ценой продажи '110' в группе с именем 'pos-group1'
And пользователь с адресом электронной почты 's41u1111@lighthouse.pro' создает продукт с именем 'pos-product13', еденицами измерения 'шт.', штрихкодом 'post-barcode-13', НДС '0', ценой закупки '100' и ценой продажи '110' в группе с именем 'pos-group1'
And пользователь с адресом электронной почты 's41u1111@lighthouse.pro' создает продукт с именем 'pos-product14', еденицами измерения 'шт.', штрихкодом 'post-barcode-14', НДС '0', ценой закупки '100' и ценой продажи '110' в группе с именем 'pos-group1'
And пользователь с адресом электронной почты 's41u1111@lighthouse.pro' создает продукт с именем 'pos-product15', еденицами измерения 'шт.', штрихкодом 'post-barcode-15', НДС '0', ценой закупки '100' и ценой продажи '110' в группе с именем 'pos-group1'
And пользователь с адресом электронной почты 's41u1111@lighthouse.pro' создает продукт с именем 'pos-product16', еденицами измерения 'шт.', штрихкодом 'post-barcode-16', НДС '0', ценой закупки '100' и ценой продажи '110' в группе с именем 'pos-group1'
And пользователь с адресом электронной почты 's41u1111@lighthouse.pro' создает продукт с именем 'pos-product17', еденицами измерения 'шт.', штрихкодом 'post-barcode-17', НДС '0', ценой закупки '100' и ценой продажи '110' в группе с именем 'pos-group1'
And пользователь с адресом электронной почты 's41u1111@lighthouse.pro' создает продукт с именем 'pos-product18', еденицами измерения 'шт.', штрихкодом 'post-barcode-18', НДС '0', ценой закупки '100' и ценой продажи '110' в группе с именем 'pos-group1'
And пользователь с адресом электронной почты 's41u1111@lighthouse.pro' создает продукт с именем 'pos-product19', еденицами измерения 'шт.', штрихкодом 'post-barcode-19', НДС '0', ценой закупки '100' и ценой продажи '110' в группе с именем 'pos-group1'
And пользователь с адресом электронной почты 's41u1111@lighthouse.pro' создает продукт с именем 'pos-product20', еденицами измерения 'шт.', штрихкодом 'post-barcode-20', НДС '0', ценой закупки '100' и ценой продажи '110' в группе с именем 'pos-group1'